; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v2 - type_1 ?v5 - type_3)
 	      (pred_4 ?v7 - object ?v5 - type_3)
	      (pred_1 ?v2 - type_1 ?v6 - type_2)
	      (pred_3 ?v2 - type_1 ?v7 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v1 ?v4 - type_3)
       :precondition (and  (pred_2 ?v2 ?v1))
       :effect (and  (pred_2 ?v2 ?v4)
		     (not (pred_2 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_1 ?v8 - object ?v3 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v3) (pred_2 ?v2 ?v3) (pred_1 ?v2 ?v6))
       :effect (and (pred_3 ?v2 ?v8 ?v6)
		    (not (pred_4 ?v8 ?v3)) 
		    (not (pred_1 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_1 ?v8 - object ?v3 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v8 ?v6) (pred_2 ?v2 ?v3))
       :effect (and (pred_4 ?v8 ?v3)
		    (pred_1 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v8 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_13 - type_1
obj_08 obj_14 obj_03 obj_02 - type_2
obj_10 obj_01 obj_12 obj_06 - type_3
obj_05 obj_04 obj_11 obj_09 - object)
(:init
(pred_2 obj_07 obj_12)
(pred_1 obj_07 obj_08)
(pred_1 obj_07 obj_14)
(pred_2 obj_13 obj_01)
(pred_1 obj_13 obj_03)
(pred_1 obj_13 obj_02)
(pred_4 obj_05 obj_01)
(pred_4 obj_04 obj_01)
(pred_4 obj_11 obj_12)
(pred_4 obj_09 obj_10)
)
(:goal
(and
(pred_4 obj_05 obj_10)
(pred_4 obj_04 obj_12)
(pred_4 obj_11 obj_06)
(pred_4 obj_09 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_06)))
)
)

; plan
1. (op_2 obj_07 obj_12 obj_10)
   deleted: (pred_2 obj_07 obj_12)
   added: (pred_2 obj_07 obj_10)
   goals met: 0 of 4
2. (op_3 obj_13 obj_04 obj_01 obj_02)
   deleted: (pred_4 obj_04 obj_01) (pred_1 obj_13 obj_02)
   added: (pred_3 obj_13 obj_04 obj_02)
   goals met: 0 of 4
3. (op_3 obj_13 obj_05 obj_01 obj_03)
   deleted: (pred_4 obj_05 obj_01) (pred_1 obj_13 obj_03)
   added: (pred_3 obj_13 obj_05 obj_03)
   goals met: 0 of 4
4. (op_2 obj_13 obj_01 obj_12)
   deleted: (pred_2 obj_13 obj_01)
   added: (pred_2 obj_13 obj_12)
   goals met: 0 of 4
5. (op_3 obj_07 obj_09 obj_10 obj_14)
   deleted: (pred_4 obj_09 obj_10) (pred_1 obj_07 obj_14)
   added: (pred_3 obj_07 obj_09 obj_14)
   goals met: 0 of 4
6. (op_2 obj_07 obj_10 obj_12)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_12)
   goals met: 0 of 4
7. (op_1 obj_13 obj_04 obj_12 obj_02)
   deleted: (pred_3 obj_13 obj_04 obj_02)
   added: (pred_4 obj_04 obj_12) (pred_1 obj_13 obj_02)
   goals met: 1 of 4
8. (op_2 obj_13 obj_12 obj_10)
   deleted: (pred_2 obj_13 obj_12)
   added: (pred_2 obj_13 obj_10)
   goals met: 1 of 4
9. (op_1 obj_07 obj_09 obj_12 obj_14)
   deleted: (pred_3 obj_07 obj_09 obj_14)
   added: (pred_4 obj_09 obj_12) (pred_1 obj_07 obj_14)
   goals met: 2 of 4
10. (op_3 obj_07 obj_11 obj_12 obj_08)
   deleted: (pred_4 obj_11 obj_12) (pred_1 obj_07 obj_08)
   added: (pred_3 obj_07 obj_11 obj_08)
   goals met: 2 of 4
11. (op_2 obj_07 obj_12 obj_10)
   deleted: (pred_2 obj_07 obj_12)
   added: (pred_2 obj_07 obj_10)
   goals met: 2 of 4
12. (op_1 obj_07 obj_11 obj_10 obj_08)
   deleted: (pred_3 obj_07 obj_11 obj_08)
   added: (pred_4 obj_11 obj_10) (pred_1 obj_07 obj_08)
   goals met: 2 of 4
13. (op_1 obj_13 obj_05 obj_10 obj_03)
   deleted: (pred_3 obj_13 obj_05 obj_03)
   added: (pred_4 obj_05 obj_10) (pred_1 obj_13 obj_03)
   goals met: 3 of 4
14. (op_3 obj_13 obj_11 obj_10 obj_02)
   deleted: (pred_4 obj_11 obj_10) (pred_1 obj_13 obj_02)
   added: (pred_3 obj_13 obj_11 obj_02)
   goals met: 3 of 4
15. (op_2 obj_13 obj_10 obj_06)
   deleted: (pred_2 obj_13 obj_10)
   added: (pred_2 obj_13 obj_06)
   goals met: 3 of 4
16. (op_1 obj_13 obj_11 obj_06 obj_02)
   deleted: (pred_3 obj_13 obj_11 obj_02)
   added: (pred_4 obj_11 obj_06) (pred_1 obj_13 obj_02)
   goals met: 4 of 4
